// 문제 
/*
연도가 주어졌을 때, 윤년이면 1, 아니면 0을 출력하는 프로그램을 작성하시오.

윤년은 연도가 4의 배수이면서, 100의 배수가 아닐 때 또는 400의 배수일 때이다.

예를 들어, 2012년은 4의 배수이면서 100의 배수가 아니라서 윤년이다. 1900년은 100의 배수이고 400의 배수는 아니기 때문에 윤년이 아니다. 하지만, 2000년은 400의 배수이기 때문에 윤년이다.
*/

// 입력
/*
첫째 줄에 연도가 주어진다. 연도는 1보다 크거나 같고, 4000보다 작거나 같은 자연수이다.
*/

// 출력
/*
첫째 줄에 윤년이면 1, 아니면 0을 출력한다.
*/
#include <stdio.h>

int main() {
  int year;
  
  printf("윤년을 확인하고 싶은 년도를 입력: \n");
  scanf("%d", &year);

  /*
   and 와 or 의 비트 연산자 vs 논리 연산자
   1. 비트 연산자 : 
    - &, | 로 표기한다.
    - 비트 연산자는 0과 1뿐 아니라 비트 단위로 전부 비교하므로, 조건의 우선순위와 값이 바뀔 수 있다.
   2. 논리 연산자 :
    - &&, || 로 표기한다.
    - 이 방법이 일반적으로 값을 비교할 때 사용하며 불필요한 계산이 없다는 장점이 있다.
  */
  if ((year%4 == 0 && year%100 != 0) || (year%400 == 0)) {
    printf("%d년은 윤년이다.: %d", year, 1);
  }
  else {
    printf("%d년은 윤년이다.: %d", year, 0);
  }

  return 0;
}