// 문제 
/*
N을 입력받은 뒤, 구구단 N단을 출력하는 프로그램을 작성하시오. 출력 형식에 맞춰서 출력하면 된다.
*/

// 입력
/*
첫째 줄에 N이 주어진다. N은 1보다 크거나 같고, 9보다 작거나 같다.
*/

// 출력
/*
출력형식과 같게 N*1부터 N*9까지 출력한다.
*/
#include <stdio.h>

int main() {
  int target; // 대상 변수 타입 선언
  
  printf("구구단 몇 단을 출력할까요?\n");
  scanf("%d", &target); // 변수값 지정

  for (int i = 1; i <= 9; i++) {  // for 반복문 (대상 변수 선언 및 초기화; 종료 조건식; 증감식)
    printf("\n%d X %d = %d", target, i, target * i);  // printf 함수에서 ""이후의 comma(,)는 인수 구분자로 작동하여 포맷팅 대상 변수를 튜플 형태로 나타내지 않아야 한다.
  }  

  return 0;
}