# 문제 
'''
2022 연세대학교 미래캠퍼스 슬기로운 코딩생활에 N명의 학생들이 응시했다.

이들 중 점수가 가장 높은 k명은 상을 받을 것이다.
이 때, 상을 받는 커트라인이 몇 점인지 구하라.

커트라인이란 상을 받는 사람들 중 점수가 가장 낮은 사람의 점수를 말한다.
'''

# 입력
'''
첫째 줄에는 응시자의 수 N과 상을 받는 사람의 수 k가 공백을 사이에 두고 주어진다.

둘째 줄에는 각 학생의 점수 x가 공백을 사이에 두고 주어진다.
'''

# 출력
'''
상을 받는 커트라인을 출력하라.
'''

N, k = map(int, input("N, k: ").split())
student = list(map(int, input().split()))

if N != len(student):   # N과 입력된 학생 수가 일치하지 않으면 종료
    print("학생 수가 일치하지 않습니다.")
    exit()

# 성적 내림차순
student.sort(reverse=True)
print(f"커트라인 : {student[k-1]}")

# # 성적 오름차순 인덱스 -로 접근
# student.sort()
# print(f"커트라인 : {student[-k]}")