# 문제 
'''
지원이에게 2진 수열을 가르쳐 주기 위해, 지원이의 아버지는 그에게 타일들을 선물해주셨다.
그리고 이 각각의 타일들은 0 또는 1이 쓰여 있는 낱장의 타일들이다.

어느날 짓궂은 동주가 지원이의 공부를 방해하기 위해 0이 쓰여진 낱장의 타일들을 붙여서 한 쌍으로 이루어진 00타일들이 만들었다.
결국 현재 1 하나만으로 이루어진 타일 또는 0타일을 두 개 붙인 한 쌍의 00타일들만이 남게 되었다.

그러므로 지원이는 타일로 더 이상 크기가 N인 모든 2진 수열을 만들 수 없게 되었다.
예를 들어, N=1일 때 1만 만들 수 있고, N=2일 때는 00, 11을 만들 수 있다.
(01, 10은 만들 수 없게 되었다.)
또한 N=4일 때는 0011, 0000, 1001, 1100, 1111 등 총 5개의 2진 수열을 만들 수 있다.

우리의 목표는 N이 주어졌을 때, 지원이가 만들 수 있는 모든 가짓수를 세는 것이다.
단, 타일들은 무한히 많은 것으로 가정하자.
'''

# 입력
'''
첫 번째 줄에 자연수 N이 주어진다. (1 <= N <= 1,000,000)
'''

# 출력
'''
첫 번째 줄에 지원이가 만들 수 있는 길이가 N인 모든 2진 수열의 개수를 15746으로 나눈 나머지를 출력한다.
'''

# 완전 탐색 형태여서 작은 숫자일 때는 유리하지만
# N 값이 커지면 시간이 지나치게 오래걸림
def find(length, string) :
    global count
    if len(string) == length:
        count += 1
        return
    
    if len(string) > length:
        return
    
    find(length, string +'00')
    find(length, string + '1')

count = 0

N = int(input("N: "))

find(N, '')

print(count)

#################################################################

# 00 타일과 1 타일로 나뉘어져 다음과 같이 점화식을 도출할 수 있게 됨
# 1. 길이가 N-1 인 경우 뒤에 '1'을 붙이는 방법
# 2. 길이가 N-2 인 경우 뒤에 '00'을 붙이는 방법
# f(N) = f(N-1) + f(N-2) 이라는 점화식이 도출됨

# N = int(input("N: "))

# if N == 1:
#     print(1)
#     exit()
# elif N == 2:
#     print(2)
#     exit()

# MOD = 15746
# prev2, prev1 = 1, 2  # f(1) = 1, f(2) = 2

# for _ in range(3, N + 1):
#     curr = (prev1 + prev2) % MOD
#     prev2, prev1 = prev1, curr

# print(prev1)