# 문제 
'''
(세 자리 수)x(세 자리 수)는 다음과 같은 과정을 통하여 이루어진다.
(1)과 (2)위치에 들어갈 세 자리 자연수가 주어질 때 (3),(4),(5),(6) 위치에 들어갈 값을 구하는 프로그램을 작성하시오.

원본 링크 : https://www.acmicpc.net/problem/2588
'''

# 입력
'''
첫째 줄에 (1)의 위치에 들어갈 세 자리 자연수가, 둘째 줄에 (2)의 위치에 들어갈 세자리 자연수가 주어진다.
'''

# 출력
'''
첫째 줄부터 넷째 줄까지 차례대로 (3), (4), (5), (6)에 들어갈 값을 출력한다.
'''

num01 = int(input("첫번째 세자리 수: "))
num02 = int(input("두번째 세자리 수: "))

mult_01 = num01 * (num02 % 10)
mult_02 = num01 * ((num02 % 100) // 10)
mult_03 = num01 * (num02 // 100)

print("(3)에 들어갈 수: ", end='')
print(mult_01)
print("(4)에 들어갈 수: ", end='')
print(mult_02)
print("(5)에 들어갈 수: ", end='')
print(mult_03)
print("(6)에 들어갈 수: ", end='')
print(mult_01 + (mult_02*10) + (mult_03*100))